wei134102/OpenFIRE-Firmware-ESP32/shared_lib/OpenFIRE_Wireless/ESP32/OpenFIRE_Wireless.cpp


#if defined(OPENFIRE_WIRELESS_ENABLE) && defined(ARDUINO_ARCH_ESP32)

#include "OpenFIRE_Wireless.h"
#include "esp_idf_version.h"

#ifdef DONGLE
  #ifdef USES_DISPLAY
    #ifdef USE_LOVYAN_GFX
      #define LGFX_USE_V1
      #include <LovyanGFX.hpp>
      #include "LGFX_096_ST7735S_80x160.hpp"
      extern LGFX tft;
      #define WHITE            TFT_WHITE
      #define BLACK            TFT_BLACK
      #define BLUE             TFT_BLUE
      #define RED              TFT_RED
      #define MAGENTA          TFT_MAGENTA
      #define GREEN            TFT_GREEN
      #define CYAN             TFT_CYAN
      #define YELLOW           TFT_YELLOW
      #define BROWN            TFT_BROWN
      #define GRAY             TFT_LIGHTGRAY
      #define ORANGE           TFT_ORANGE
    #else
      #include <Adafruit_ST7735.h>
      extern Adafruit_ST7735 tft;
      #define WHITE            ST7735_WHITE
      #define BLACK            ST7735_BLACK
      #define BLUE             ST7735_BLUE
      #define RED              ST7735_RED
      #define MAGENTA          ST7735_MAGENTA
      #define GREEN            ST7735_GREEN
      #define CYAN             ST7735_CYAN
      #define YELLOW           ST7735_YELLOW
      #define BROWN            0XBC40
      #define GRAY             0X8430
      #define ORANGE           ST7735_ORANGE
    #endif // USE_LOVYAN_GFX
  #endif // USES_DISPLAY
#endif // DONGLE

#ifdef GUN
  #ifdef USES_DISPLAY
    //#include "../../src/OpenFIREdisplay.h"
    //#include "../../src/OpenFIREcommon.h"
    #ifdef USE_LOVYAN_GFX
      #include <LovyanGFX.hpp>
      #include "LGFX_096_SSD1306_64x128.hpp"
      extern LGFX_SSD1306 *&display_OLED;
    #else
      #include <Adafruit_SSD1306.h>
      extern Adafruit_SSD1306 *&display_OLED;
      //extern ExtDisplay OLED;
    #endif // USE_LOVYAN_GFX
  #endif // USES_DISPLAY
#endif // GUN

extern bool display_init;


#ifndef OPENFIRE_ESPNOW_WIFI_CHANNEL
  #define OPENFIRE_ESPNOW_WIFI_CHANNEL 11 // canale sul quale si sintonizza la lightgun di default
#endif // OPENFIRE_ESPNOW_WIFI_CHANNEL

#ifndef OPENFIRE_ESPNOW_WIFI_POWER
  // la potenza di trasmissione può andare da 8 a 84, dove 84 è il valore massimo che corrisponde a 21 db (x4)
  //#define OPENFIRE_ESPNOW_WIFI_POWER WIFI_POWER_15dBm  // corrisponde a 60 .. potenza più conservativa ma con segnale eccellente
  #define OPENFIRE_ESPNOW_WIFI_POWER WIFI_POWER_17dBm  // corrisponde a 68 .. massima potenza senza distursioni con segnale eccellette
  
#endif //OPENFIRE_ESPNOW_WIFI_POWER

uint8_t espnow_wifi_channel = OPENFIRE_ESPNOW_WIFI_CHANNEL;  // FATTA VARIABILE PER FUTURA CONFIGURAZIONE TRAMITE APP O OLED
uint8_t espnow_wifi_power = OPENFIRE_ESPNOW_WIFI_POWER;      // FATTA VARIABILE PER FUTURA CONFIGURAZIONE TRAMITE APP O OLED

#ifdef OPENFIRE_USE_ESPNOW_UNIFIED_PACKET
  hid_abs_mouse_report_t absmouse5Report_last_wifi = {0,0,0,0,0};
  hid_keyboard_report_t  keyReport_last_wifi = {0,0,{0,0,0,0,0,0}};
  hid_gamepad16_report_t gamepad16Report_last_wifi = {0,0,0,0,0,0,0,0};
#endif // OPENFIRE_USE_ESPNOW_UNIFIED_PACKET


#ifdef OPENFIRE_ESPNOW_WIFI_POWER_AUTO
  bool espnow_wifi_power_auto = true;
#endif // OPENFIRE_ESPNOW_WIFI_POWER_AUTO


USB_Data_GUN_Wireless usb_data_wireless = {
  "OpenFIRE_DONGLE",  // MANIFACTURES
  "FIRECon",          // NAME
  0xF143,             // VID
  0x1998, // 0x0001   // PID
  1,                  // PLAYER
  espnow_wifi_channel
  //OPENFIRE_ESPNOW_WIFI_CHANNEL // CHANNEL
  //,""               // ????
};

SerialWireless_ SerialWireless;
extern Adafruit_USBD_HID usbHid;
SemaphoreHandle_t tx_sem = NULL; // usato per callbalck dio fine trasmissione espnow


SemaphoreHandle_t mutex_tx_serial = NULL; // usato per trasmettere buffer seriale
SemaphoreHandle_t mutex_writer_bin = NULL; // usato per trasmettere buffer seriale

uint8_t buffer_espnow[ESP_NOW_MAX_DATA_LEN];
esp_now_peer_info_t peerInfo; // deve stare fuori funzioni da funzioni -- globale --variabile di utilità per configurazione

static void _esp_now_rx_cb(const esp_now_recv_info_t *info, const uint8_t *data, int len); // callback esp_now


#if ESP_IDF_VERSION_MAJOR == 5 && ESP_IDF_VERSION_MINOR <= 4
  // Codice per versioni fino alla 5.4
  static void _esp_now_tx_cb(const uint8_t *mac_addr, esp_now_send_status_t status); // callback esp_now
#elif ESP_IDF_VERSION_MAJOR > 5 || (ESP_IDF_VERSION_MAJOR == 5 && ESP_IDF_VERSION_MINOR >= 5)
  // Codice per versioni 5.5 o superiori
  static void _esp_now_tx_cb(const esp_now_send_info_t *tx_info, esp_now_send_status_t status); // callback esp_now // poer nuova versione IDF 55
#endif


void packet_callback_read_dongle(); // callback packet 
void packet_callback_read_gun(); // callback packet
void packet_callback_read_pedal(); // callback packet

///////////////////////////////////////////////////////////////////
//#define SIZE_BASE_AUX 13
uint8_t aux_buffer[13 + sizeof(usb_data_wireless)];
// 1 BYTE INDICATA L'AVANZAMENTO DELLO STABILIMENTO DELLA CONNESSIONE,A CHE PUNTO SIAMO
// 6 BYTE IL MAC ADDRESS DEL DISPOSITIVO CHE TRASMETTE
// 6 BYTE IL MAC ADDRESS DEL DISPOSITIVO A CUI E' INDIRIZZATO IL PACCHETTO
// ALL'ULTIMO INVIO LA GUN INVIA ANCHE I DATI DELLA STRUTTURA USB_DATA_WIRELESS CHE CONTIENE VID, PID, ECC. DELLA GUN IN MODO CHE IL DONGLE INZIALIZZI LA CONSSESIONE USB CON QUEI DATI


//uint8_t mac_esp_another_card[6];
//uint8_t stato_conneddione_wireless = 0;
uint8_t tipo_connessione = 0;

// stato della connessione 

// in caso di DONGLE
// 0 = non stabilita
// 1 = inviata richiesta blroad cast
// 2 = qualcuno ha risposto alla connessione ed ha chiesto di essere conesso
// 3 = inviato conferma connessione;

// in caso di GUN
// 0 = non stabilita
// 1 = arrivata richiesta broadcast di connessione
// 2 = accettata ed inviata richiesta di connessione
// 3 = arrivara accettazione di connessione

const uint8_t BROADCAST_ADDR[6] = {0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF};
#if defined(DONGLE)
  ///////////////////////uint8_t peerAddress[6] = {0x24, 0x58, 0x7C, 0xDA, 0x38, 0xA0}; // quello montato con piedini su breackboard
  uint8_t peerAddress[6] = {0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF}; // broadcast

  const functionPtr callbackArr[] = { packet_callback_read_dongle };
  uint8_t lastDongleAddress[6] = {0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF};
  uint8_t lastDongleChannel = OPENFIRE_ESPNOW_WIFI_CHANNEL;
  bool lastDongleSave = false; // se true significa che abbiamo un indirizzo dell'ultimo dongle altrimenti false
  #elif defined(PEDAL)
  ///////////////////////uint8_t peerAddress[6] = {0x24, 0x58, 0x7C, 0xDA, 0x38, 0xA0}; // quello montato con piedini su breackboard
  uint8_t peerAddress[6] = {0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF}; // broadcast

  const functionPtr callbackArr[] = { packet_callback_read_pedal };
  uint8_t lastDongleAddress[6] = {0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF};
  uint8_t lastDongleChannel = OPENFIRE_ESPNOW_WIFI_CHANNEL;
  bool lastDongleSave = false; // se true significa che abbiamo un indirizzo dell'ultimo dongle altrimenti false
  #elif defined(GUN)
  //const uint8_t peerAddress[6] = {0xA0, 0x85, 0xE3, 0xE8, 0x0F, 0xB8}; // espe32s3 con piedini (riceve ma non trasmette)
  ///////////////////////////uint8_t peerAddress[6] = {0xA0, 0x85, 0xE3, 0xE7, 0x65, 0xD4}; // espe32s3 senz apiedini
  uint8_t peerAddress[6] = {0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF}; // broadcast
  //const uint8_t peerAddress[6] = {0xF0, 0x9E, 0x9E, 0x28, 0x9E, 0xB8}; // DONGLE LILYGO

  const functionPtr callbackArr[] = { packet_callback_read_gun };

  // nel caso si spenga la pistola ed abbiamo memorizzato l'ultimo dongle connesso, prova a riconnettersi subito
  uint8_t lastDongleAddress[6] = {0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF};
  uint8_t lastDongleChannel = OPENFIRE_ESPNOW_WIFI_CHANNEL;
  bool lastDongleSave = false; // se true significa che abbiamo un indirizzo dell'ultimo dongle altrimenti false
  // ==========================================================================================================

#endif

// ========= per gestione PEDAL ===========
uint8_t peerAddress_pedal[6] = {0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF}; // broadcast
//unsigned long lastMillis_packet_pedal = 0;
#define MAX_TIMEOUT_LAST_PACKET (uint64_t)100000   // = 100  ms  .. il valore va specificato in microsecondi
void setupTimerPedal();
//void stopTimer_pedal();
//void resetTimer_pedal(uint64_t duration_us);
esp_timer_handle_t timer_handle_pedal;
//bool last_pedal;
//bool last_pedal2;
// ===================================================


///////////////////////////////////////////////////////////////////
// Definizione globale della configurazione del rate
esp_now_rate_config_t rate_config = {
    .phymode = WIFI_PHY_MODE_11G, // Forza lo standard G
    .rate = WIFI_PHY_RATE_12M,    // Forza i 12 Mbps
    .ersu = false,                // Non necessario per 11g
    .dcm = false                  // Non necessario per 11g
};
////////////////////////////////////////////////////////////////////

