wei134102/OpenFIRE-Firmware-ESP32/shared_lib/OpenFIRE_Wireless/ESP32/OpenFIRE_Wireless.cpp
#ifdef OPENFIRE_ESPNOW_WIFI_POWER_AUTO
// ---------------- INIZIO LOGICA TPC ----------------
// Variabile globale per salvare l'RSSI istantaneo del pacchetto appena arrivato
volatile int8_t last_rssi_percepito = -100;
int8_t ultimo_rssi_trasmesso = TARGET_RSSI;
int8_t espnow_rssi_ricevuto = 0;
//volatile int8_t last_rssi_percepito = -100;
// ultimo_rssi_trasmesso = last_rssi_percepito;

uint8_t calcolaPotenzaOttimale(int8_t rssi_remoto) {
    // Usiamo direttamente int16_t per evitare cast impliciti continui nei calcoli successivi
    int16_t potenza_attuale = espnow_wifi_power;

    // Calcolo in un'unica riga: 
    // Usiamo lo shift bit a bit (<< 1) al posto della moltiplicazione (* 2) per massima velocità hardware
    potenza_attuale += (TARGET_RSSI - rssi_remoto) * 2; // * 4; 

    // AGGIUNGIAMO UN MARGINE DI SICUREZZA DI +2 dBm (8 unità) 
    // visto che la potenza non verrà più corretta in volo!
    //potenza_attuale += 8;
    
    #if defined(GUN)
        // La GUN scende per risparmiare batteria
        potenza_attuale = constrain(potenza_attuale, WIFI_POWER_MIN, WIFI_POWER_MAX);
    #elif defined(DONGLE)
        // Il DONGLE resta mediamente alto (minimo 40) perché ha la corrente via USB
        potenza_attuale = constrain(potenza_attuale, 40, WIFI_POWER_MAX);
    #elif defined(PEDAL)
        // Il DONGLE resta mediamente alto (minimo 40) perché ha la corrente via USB
        potenza_attuale = constrain(potenza_attuale, 40, WIFI_POWER_MAX);   
    #endif

    return (uint8_t)potenza_attuale;
}


// ---------------- FINE LOGICA TPC ----------------
#endif //OPENFIRE_ESPNOW_WIFI_POWER_AUTO

///////////////////////////////////////////////////////////////////

volatile uint8_t channel_display = espnow_wifi_channel;
volatile uint8_t seconds_display = 30;
volatile bool broadcast_receiver = false;  // ??????? non serve

/////////////////////////////////////////////////////////////////////////////
// VERSIONE GRAFICA RICERCA CANALE PER GUN //////////////////////////////////
/////////////////////////////////////////////////////////////////////////////

#if defined(GUN) && defined(USES_DISPLAY)
void animTaskLink_pedal(void *pvParameters) {
  unsigned long lastChange = 0;
  int8_t currentIndex = 0;
  int8_t direzione = 1;
  const char* word = "Scanning WiFi (((o)))"; // Waiting link 
  const char* rotazione = "-\\|/-\\|/";
  int8_t rotazioneIndex = 0;
  const uint8_t baseX = 1;
  const uint8_t baseY = 2;
  const uint8_t charWidth = 6;
  uint8_t len_word = strlen(word);
  uint8_t seconds_tread = 30;
  
  // Setup iniziale display
  display_OLED->setCursor(baseX, baseY);
  display_OLED->setTextSize(1);
  display_OLED->setTextColor(WHITE, BLACK);
  display_OLED->fillRect(0, 0, 128, 16, BLACK);
  display_OLED->drawFastHLine(0, 15, 128, WHITE);
  char buffer[30];
  sprintf(buffer, "Search Pedal [%2ds]", seconds_tread);                  
  display_OLED->print(buffer);
  display_OLED->display();

  // Loop del task
  for (;;) {
    if (seconds_display != seconds_tread)
    {
      display_OLED->setCursor((14*6)+1, 2);
              //display_OLED->setTextSize(1);
              //display_OLED->setTextColor(WHITE, BLACK);
              ///////////display_OLED->fillRect(0, 0, 128, 16, BLACK);
              //display_OLED->drawFastHLine(0, 15, 128, WHITE);
      seconds_tread = seconds_display;
      sprintf(buffer, "%2d", seconds_tread);
      display_OLED->print(buffer);
              //display_OLED->display();          
      

      //seconds_tread = seconds_display;
    }
    display_OLED->setCursor(baseX + (19 * charWidth), baseY);
    display_OLED->write(rotazione[rotazioneIndex]);
    rotazioneIndex = (rotazioneIndex + 1) % 8;
    display_OLED->display();
    vTaskDelay(pdMS_TO_TICKS(150)); // piccolo delay per non saturare la CPU
  } 
}
#endif // GUN



#if defined(GUN) && defined(USES_DISPLAY)
void animTaskLink(void *pvParameters) {
  unsigned long lastChange = 0;
  int8_t currentIndex = 0;
  int8_t direzione = 1;
  const char* word = "Scanning WiFi (((o)))"; // Waiting link 
  const char* rotazione = "-\\|/-\\|/";
  int8_t rotazioneIndex = 0;
  const uint8_t baseX = 1;
  const uint8_t baseY = 2;
  const uint8_t charWidth = 6;
  uint8_t len_word = strlen(word);
  uint8_t channel_tread = espnow_wifi_channel;
  
  // Setup iniziale display
  display_OLED->setCursor(baseX, baseY);
  display_OLED->setTextSize(1);
  display_OLED->setTextColor(WHITE, BLACK);
  display_OLED->fillRect(0, 0, 128, 16, BLACK);
  display_OLED->drawFastHLine(0, 15, 128, WHITE);
  char buffer[30];
  sprintf(buffer, "Ch:%2d Waiting link", channel_tread);
  display_OLED->print(buffer);
  display_OLED->display();

  // Loop del task
  for (;;) {
    if (channel_display != channel_tread)
    {
      display_OLED->setCursor(19, 2);
              //display_OLED->setTextSize(1);
              //display_OLED->setTextColor(WHITE, BLACK);
              ///////////display_OLED->fillRect(0, 0, 128, 16, BLACK);
              //display_OLED->drawFastHLine(0, 15, 128, WHITE);
      channel_tread = channel_display;
      sprintf(buffer, "%2d", channel_tread);
      display_OLED->print(buffer);
              //display_OLED->display();          
      

      //channel_tread = channel_display;
    }
    display_OLED->setCursor(baseX + (19 * charWidth), baseY);
    display_OLED->write(rotazione[rotazioneIndex]);
    rotazioneIndex = (rotazioneIndex + 1) % 8;
    display_OLED->display();
    vTaskDelay(pdMS_TO_TICKS(150)); // piccolo delay per non saturare la CPU
  } 
}
#endif // GUN



/////////////////////////////////////////////////////////////////////////////
// FINE VERSIONE GRAFICA RICERCA CANALE PER GUN /////////////////////////////
/////////////////////////////////////////////////////////////////////////////

/////////////////////////////////////////////////////////////////////////////
// VERSIONE GRAFICA RICERCA CANALE PER DONGLE ///////////////////////////////
/////////////////////////////////////////////////////////////////////////////

