wei134102/OpenFIRE-Firmware-ESP32/shared_lib/OpenFIRE_Wireless/ESP32/OpenFIRE_Wireless.cpp
void SerialWireless_::init_wireless() {
  configST myConfig; // variabile di utilità per configurazione
  // ============ inizializzazione semafori =============
  tx_sem = xSemaphoreCreateBinary();
  mutex_tx_serial = xSemaphoreCreateMutex();
  mutex_writer_bin = xSemaphoreCreateMutex();

  xSemaphoreGive(tx_sem);
  xSemaphoreGive(mutex_tx_serial);
  xSemaphoreGive(mutex_writer_bin);
  // ==== fine inizializzazione semafori

  myConfig.port         = &Serial; // questo andrà tolta - rimasta solo per contabilità =========================================
  myConfig.debug        = false; //true; //false; //true;
  myConfig.debugPort    = &Serial;
  myConfig.timeout      = DEFAULT_TIMEOUT; // 50ms
  myConfig.callbacks    = callbackArr;
  //myConfig.callbacks    = NULL;
  myConfig.callbacksLen = sizeof(callbackArr) / sizeof(functionPtr);
  //myConfig.callbacksLen = 0;
  packet.begin(myConfig);

  setupTimerSerial(); // crea i timer .. timer per invio dati seriali

}


void SerialWireless_::begin() {
  #ifdef COMMENTO
  configST myConfig; // variabile di utilità per configurazione
  // ============ inizializzazione semafori =============
  tx_sem = xSemaphoreCreateBinary();
  mutex_tx_serial = xSemaphoreCreateMutex();
  mutex_writer_bin = xSemaphoreCreateMutex();

  xSemaphoreGive(tx_sem);
  xSemaphoreGive(mutex_tx_serial);
  xSemaphoreGive(mutex_writer_bin);
  // ==== fine inizializzazione semafori
  #endif //COMMENTO

  #ifdef GUN
    if (lastDongleSave) espnow_wifi_channel=lastDongleChannel;
      else espnow_wifi_channel=OPENFIRE_ESPNOW_WIFI_CHANNEL;
  #endif //GUN

  #ifdef DONGLE
    
      #ifdef OPENFIRE_AUTO_CHANNEL_ESPNOW_WIFI
        espnow_wifi_channel = findBestChannel(); //12;             
      #else
        espnow_wifi_channel=OPENFIRE_ESPNOW_WIFI_CHANNEL;
      #endif // OPENFIRE_AUTO_CHANNEL_ESPNOW_WIFI
     
  #endif // DONGLE

  #ifdef PEDAL
      espnow_wifi_channel=OPENFIRE_ESPNOW_WIFI_CHANNEL;
  #endif //GUN


  WiFi.mode(WIFI_STA); 
  WiFi.disconnect();  // ??? SI va messo
  

  esp_err_t err = esp_wifi_set_protocol(WIFI_IF_STA, WIFI_PROTOCOL_11G); // | WIFI_PROTOCOL_11N);
  if (err != ESP_OK) {
    //Serial.printf("esp_wifi_set_protocol failed! 0x%x", err);
  }
  
  err = esp_wifi_set_bandwidth(WIFI_IF_STA, WIFI_BW_HT20);
  if (err != ESP_OK) {
    //Serial.printf("esp_wifi_set_bandwidth failed! 0x%x", err);
  }
  
  err = esp_wifi_get_mac(WIFI_IF_STA, mac_esp_inteface);
  if (err != ESP_OK) {
    //Serial.println("Failed to read MAC address");
  }
  
  esp_wifi_set_promiscuous(true);
  err = esp_wifi_set_channel(espnow_wifi_channel, WIFI_SECOND_CHAN_NONE);
  if (err != ESP_OK) {
    //Serial.printf("esp_wifi_set_channel failed! 0x%x", err);
  }
  esp_wifi_set_promiscuous(false);

  err = esp_wifi_set_max_tx_power(espnow_wifi_power); // tra 8 e 84 corrispondenti a 2dbm a 20 dbm);
  if (err != ESP_OK) {
    //Serial.printf("esp_wifi_set_max_tx_power failed! 0x%x", err);
  }

  err = esp_wifi_set_ps(WIFI_PS_NONE);  // DISABILITA IL POWER SAVE PER MASSIMA REATTIVITà
  if (err != ESP_OK) {
    //Serial.printf("esp_wifi_set_ps failed! 0x%x", err);
  }
  
  vTaskDelay(pdMS_TO_TICKS(500)); // delay(1000);
    
  err = esp_now_init();
  if (err != ESP_OK) {
    //Serial.printf("esp_now_init failed! 0x%x", err);
  }
    
  if (err != ESP_OK) {
    //Serial.printf("esp_now_init failed! 0x%x", err);
  }

  if (lastDongleSave) {
    memcpy(peerAddress, lastDongleAddress,6);
    stato_connessione_wireless = CONNECTION_STATE::NONE_CONNECTION_DONGLE;
  } else {
    memcpy(peerAddress, BROADCAST_ADDR, 6);
    stato_connessione_wireless = CONNECTION_STATE::NONE_CONNECTION;
  }
  
  memcpy(peerInfo.peer_addr, peerAddress, 6);
  peerInfo.channel = espnow_wifi_channel;
  peerInfo.encrypt = false;
  if (esp_now_add_peer(&peerInfo) != ESP_OK) {
    //Serial.println("Errore nell'aggiunta del peer");
  } else esp_now_set_peer_rate_config(peerAddress, &rate_config);

  err = esp_now_register_recv_cb(_esp_now_rx_cb);
  if (err != ESP_OK) {
    //Serial.printf("esp_now_register_recv_cb failed! 0x%x", err);
  }

  err = esp_now_register_send_cb(_esp_now_tx_cb);
  if (err != ESP_OK) {
    //Serial.printf("esp_now_register_send_cb failed! 0x%x", err);
  }

  #ifdef COMMENTO
  myConfig.port         = &Serial; // questo andrà tolta - rimasta solo per contabilità =========================================
  myConfig.debug        = false; //true; //false; //true;
  myConfig.debugPort    = &Serial;
  myConfig.timeout      = DEFAULT_TIMEOUT; // 50ms
  myConfig.callbacks    = callbackArr;
  //myConfig.callbacks    = NULL;
  myConfig.callbacksLen = sizeof(callbackArr) / sizeof(functionPtr);
  //myConfig.callbacksLen = 0;
  
  packet.begin(myConfig);
  #endif // COMMENTO

  TinyUSBDevices.wireless_mode = WIRELESS_MODE::ENABLE_ESP_NOW_TO_DONGLE;
  #ifdef COMMENTO
  setupTimerSerial(); // crea i timer .. timer per invio dati seriali
  #endif // COMMENTO
}

bool SerialWireless_::end() {

  //esp_now_del_peer(peerAddress); // non serve lo fa direttamente esp_now_deinit()
  esp_err_t err = esp_now_deinit();
  if (err != ESP_OK) {
    //Serial.printf("esp_now_deinit failed! 0x%x", err);
    return false;
  }
  WiFi.disconnect(true);
  WiFi.mode(WIFI_OFF); // Disattiva il WiFi
  esp_timer_delete(timer_handle_serial);
  return true;
}

// ============ NUOVA IMPLEMNTAZIONE == LA GUN FA IL FARO ================================
bool SerialWireless_::connection_dongle() {
    
  #if defined(DONGLE) && defined(USES_DISPLAY)
  TaskHandle_t animTaskHandleLink = NULL;  
  if(display_init) {
  // Avvio animazione
    if (animTaskHandleLink == NULL) {
      xTaskCreatePinnedToCore(
        animTaskLink,          // funzione del task
        "AnimTaskLink",        // nome
        4096,              // stack size
        NULL,              // parametri
        1,                 // priorità
        &animTaskHandleLink,   // handle
        APP_CPU_NUM        // core (puoi usare 0 o 1)
      );
    }
  }
  #endif // USES_DISPLAY

  #define TIMEOUT_GUN_DIALOGUE 1000 // in millisecondi   ?????????????????????????
  unsigned long lastMillis_start_dialogue = millis ();
  
  
  
  lastMillis_start_dialogue = millis ();
  stato_connessione_wireless = CONNECTION_STATE::NONE_CONNECTION;
    
  // ====================================================

  broadcast_receiver = true;

