wei134102/OpenFIRE-Firmware-ESP32/shared_lib/OpenFIRE_Wireless/ESP32/OpenFIRE_Wireless.cpp
  while(/*!TinyUSBDevice.mounted() && */stato_connessione_wireless != CONNECTION_STATE::DEVICES_CONNECTED) { 
    if (stato_connessione_wireless == CONNECTION_STATE::NONE_CONNECTION) {
      lastMillis_start_dialogue = millis ();
    }
    if (((millis() - lastMillis_start_dialogue) > TIMEOUT_GUN_DIALOGUE) && stato_connessione_wireless != CONNECTION_STATE::DEVICES_CONNECTED) {
      stato_connessione_wireless = CONNECTION_STATE::NONE_CONNECTION;
    }
    taskYIELD();
    //yield();
    //vTaskDelay(pdMS_TO_TICKS(10));
  }
  
  broadcast_receiver = false;

  //Serial.println("DONGLE - Negosazione completata - associazione dei dispositivi GUN/DONGLE");
  if (esp_now_del_peer(peerAddress) != ESP_OK) {  // cancella il broadcast dai peer
    //Serial.println("DONGLE - Errore nella cancellazione del peer broadcast");
  }
  memcpy(peerAddress, mac_esp_another_card, 6);
  memcpy(peerInfo.peer_addr, peerAddress, 6);
  ////////////espnow_wifi_channel=usb_data_wireless.channel;
  ////////////esp_wifi_set_promiscuous(true);
  ////////////esp_wifi_set_channel(espnow_wifi_channel, WIFI_SECOND_CHAN_NONE);
  ////////////esp_wifi_set_promiscuous(false);
  //peerInfo.channel = espnow_wifi_channel;
  //peerInfo.channel = ESPNOW_WIFI_CHANNEL;
  //peerInfo.encrypt = false;              
  if (esp_now_add_peer(&peerInfo) != ESP_OK) {  // inserisce il dongle nei peer
    //Serial.println("DONGLE - Errore nell'aggiunta del nuovo peer della GUN");
  } else esp_now_set_peer_rate_config(peerAddress, &rate_config);

  #ifdef OPENFIRE_ESPNOW_WIFI_POWER_AUTO // ==========================================================
    if (espnow_wifi_power_auto) {
      SerialWireless.SendPacket((const uint8_t *)aux_buffer, 1, PACKET_TX::RSSI_FEEDBACK);
      SerialWireless.SendPacket((const uint8_t *)aux_buffer, 1, PACKET_TX::RSSI_FEEDBACK);
      SerialWireless.SendPacket((const uint8_t *)aux_buffer, 1, PACKET_TX::RSSI_FEEDBACK);
      //espnow_wifi_power = 45;
    }
  #endif //OPENFIRE_ESPNOW_WIFI_POWER_AUTO // ==========================================================


  TinyUSBDevices.onBattery = true;
  
    #if defined(DONGLE) && defined(USES_DISPLAY)
      if (animTaskHandleLink != NULL) {
        vTaskDelete(animTaskHandleLink);
        animTaskHandleLink = NULL;
      }
    #endif // USES_DISPLAY
  
  return true; 
}


bool SerialWireless_::connection_gun_at_last_dongle() {
  #define TIMEOUT_TX_PACKET_LAST_DONGLE 300 // in millisecondi - tempo di invio pacchetti ogni millisecondi quindi 4-5 pacchetti
  #define TIMEOUT_DIALOGUE_LAST_DONGLE 2000 // in millisecondi - tempo massimo per ricerca ultimo dongle
  unsigned long lastMillis_tx_packet_last_dongle = 0;
  unsigned long lastMillis_start_dialogue_last_dongle = millis ();

  uint8_t aux_buffer_tx[13];
  
  stato_connessione_wireless = CONNECTION_STATE::NONE_CONNECTION_DONGLE;
  aux_buffer_tx[0] = CONNECTION_STATE::TX_CHECK_CONNECTION_LAST_DONGLE;
  memcpy(&aux_buffer_tx[1], SerialWireless.mac_esp_inteface, 6);
  memcpy(&aux_buffer_tx[7], peerAddress, 6);
  lastMillis_tx_packet_last_dongle = 0;
  lastMillis_start_dialogue_last_dongle = millis();
  while (!TinyUSBDevice.mounted() && 
         (stato_connessione_wireless != CONNECTION_STATE::DEVICES_CONNECTED_WITH_LAST_DONGLE) &&
         ((millis() - lastMillis_start_dialogue_last_dongle) < TIMEOUT_DIALOGUE_LAST_DONGLE)) { 
      if ((millis() - lastMillis_tx_packet_last_dongle) > TIMEOUT_TX_PACKET_LAST_DONGLE)
      {
        SerialWireless.SendPacket((const uint8_t *)aux_buffer_tx, 13, PACKET_TX::CHECK_CONNECTION_LAST_DONGLE); 
        lastMillis_tx_packet_last_dongle = millis();
      }
      
      taskYIELD();
      //vTaskDelay(pdMS_TO_TICKS(10));
      //yield();
  }
  if (stato_connessione_wireless == CONNECTION_STATE::DEVICES_CONNECTED_WITH_LAST_DONGLE) {    
    stato_connessione_wireless = CONNECTION_STATE::DEVICES_CONNECTED;
    TinyUSBDevices.onBattery = true;
    return true;
  } else {
    stato_connessione_wireless = CONNECTION_STATE::NONE_CONNECTION;
    lastDongleSave=false;
    esp_now_deinit();
    begin();
    return false;
  }
}

// ======================= NUOVA IMPLEMENTAZIONE DOVE LA GUN FA IL FARO ===============
bool SerialWireless_::connection_gun() {
  
  channel_display = espnow_wifi_channel;

  #if defined(GUN) && defined(USES_DISPLAY)
  TaskHandle_t animTaskHandleLink = NULL;  
  if(display_OLED != nullptr) {
  // Avvio animazione
    if (animTaskHandleLink == NULL) {
      xTaskCreatePinnedToCore(
        animTaskLink,          // funzione del task
        "AnimTaskLink",        // nome
        4096,              // stack size
        NULL,              // parametri
        1,                 // priorità
        &animTaskHandleLink,   // handle
        APP_CPU_NUM        // core (puoi usare 0 o 1)
      );
    }
  }
  #endif // USES_DISPLAY
  
  
  uint8_t channel = espnow_wifi_channel;   // tra e 1 e 13 (il 14 dovrebbe essere riservato)
  #define TIMEOUT_TX_PACKET 500 // in millisecondi
  #define TIMEOUT_CHANGE_CHANNEL 2000 // in millisecondi - cambia canale ogni
  #define TIMEOUT_DIALOGUE 6000 // in millisecondi - tempo massimo per completare operazione accoppiamento
  unsigned long lastMillis_tx_packet = millis ();
  unsigned long lastMillis_change_channel = millis ();
  unsigned long lastMillis_start_dialogue = millis ();
  uint8_t aux_buffer_tx[14]; // aggiunto un byte per trasmettere anche il canale di trasmissione
                             // durante tx pacchetto pubblicazione presenza, mette anche il canale
  
  
  

  // ===== IMPOSTARE IL PEER BOARCAST QUI ====================== SERVE SE SI RIPARTE DA CERCA ULTIMO DONGLE, o forse no, non ricordo .... ????????? verificare  ????
  if (esp_now_del_peer(peerAddress) != ESP_OK) {  // cancella il broadcast dai peer
    //Serial.println("Errore nella cancellazione del peer");
  }
  memcpy(peerAddress, BROADCAST_ADDR, 6);
  memcpy(peerInfo.peer_addr, peerAddress, 6);
  //peerInfo.channel = ESPNOW_WIFI_CHANNEL;
  //peerInfo.encrypt = false;              
  if (esp_now_add_peer(&peerInfo) != ESP_OK) {  // inserisce il dongle nei peer
    //Serial.println("Errore nell'aggiunta del nuovo peer");
  } else esp_now_set_peer_rate_config(peerAddress, &rate_config);                       
  // ====================================================
  
