wei134102/OpenFIRE-Firmware-ESP32/shared_lib/OpenFIRE_Wireless/ESP32/OpenFIRE_Wireless.cpp
  stato_connessione_wireless = CONNECTION_STATE::NONE_CONNECTION;
  aux_buffer_tx[0] = CONNECTION_STATE::TX_GUN_SEARCH_PEDAL_BROADCAST;
  memcpy(&aux_buffer_tx[1], SerialWireless.mac_esp_inteface, 6);
  memcpy(&aux_buffer_tx[7], peerAddress, 6);
  aux_buffer_tx[13] = espnow_wifi_channel;
 

  broadcast_receiver = true;
  
  while ( (seconds > 1) && stato_connessione_wireless != CONNECTION_STATE::DEVICES_CONNECTED) {
    if (stato_connessione_wireless == CONNECTION_STATE::NONE_CONNECTION) {
      if (((millis() - lastMillis_change_seconds) > TIMEOUT_CHANGE_SECONDS) && 
         ((millis() - lastMillis_tx_packet)) >= (TIMEOUT_TX_PACKET - 50)) {  // aggiunta impostato 50 ms come margine, per evitare che quando invia pacchetto cambi subito casnale senza dare possibilità risposta
        //channel++;
        //if (channel >13) channel = 1;
        aux_buffer_tx[13] = espnow_wifi_channel;
        seconds_display = seconds;
                        
        lastMillis_change_seconds = millis ();
        lastMillis_tx_packet = 0;
        
        seconds--;
      }
      if ((millis() - lastMillis_tx_packet) > TIMEOUT_TX_PACKET) {
        // ??????????????????????? siatemare per gestione pedal di SendPacket ????????????????? .. ci vorrà un buffer per ogni peer o gestire diversamente le cose a seconda di chi si trasmettono i dati oppure si sposta provvisoriamente il peeraddres solo durante ricerca pedale
        SerialWireless.SendPacket((const uint8_t *)aux_buffer_tx, 14, PACKET_TX::CONNECTION_PEDAL); // aggiunto un byte per trasmettere anche il canale di trasmissione
        //Serial.print("DONGLE - inviato pacchetto broadcast sul canale: ");
        //Serial.println(channel);
        lastMillis_tx_packet = millis (); 
      }
      lastMillis_start_dialogue = millis();
    }
    else {
      if (((millis() - lastMillis_start_dialogue) > TIMEOUT_DIALOGUE) && stato_connessione_wireless != CONNECTION_STATE::DEVICES_CONNECTED) {
        stato_connessione_wireless = CONNECTION_STATE::NONE_CONNECTION;
        //Serial.println("DONGLE - Non si è conclusa la negoziazione tra DONGLE/GUN e si riparte da capo");
        lastMillis_change_seconds = millis ();
      }  
    }
    taskYIELD();
    //yield(); // in attesa dello stabilimento di una connessione
    //vTaskDelay(pdMS_TO_TICKS(10));
  }
  
  broadcast_receiver = false;

  if (esp_now_del_peer(peerAddress) != ESP_OK) {  // cancella il broadcast dai peer
      //Serial.println("DONGLE - Errore nella cancellazione del peer broadcast");
  }

  memcpy(peerAddress, peerAddress_copy, 6);

  SerialWireless.SendPacket((const uint8_t *)&TinyUSBDevices.is_pedal_wireless, 1, PACKET_TX::PEDAL_TX);

  if (stato_connessione_wireless == CONNECTION_STATE::DEVICES_CONNECTED) {
    //Serial.println("DONGLE - Negosazione completata - associazione dei dispositivi GUN/DONGLE");
    /*
    if (esp_now_del_peer(peerAddress) != ESP_OK) {  // cancella il broadcast dai peer
      //Serial.println("DONGLE - Errore nella cancellazione del peer broadcast");
    }
    */

    memcpy(peerAddress_pedal, mac_esp_another_card, 6);
    memcpy(peerInfo.peer_addr, peerAddress_pedal, 6);
    /////espnow_wifi_channel=usb_data_wireless.channel;
    /////esp_wifi_set_promiscuous(true);
    /////esp_wifi_set_channel(espnow_wifi_channel, WIFI_SECOND_CHAN_NONE);
    /////esp_wifi_set_promiscuous(false);
    peerInfo.channel = espnow_wifi_channel;
    //peerInfo.channel = ESPNOW_WIFI_CHANNEL;
    //peerInfo.encrypt = false;              
    if (esp_now_add_peer(&peerInfo) != ESP_OK) {  // inserisce il dongle nei peer
      //Serial.println("DONGLE - Errore nell'aggiunta del nuovo peer della GUN");
    } else esp_now_set_peer_rate_config(peerAddress_pedal, &rate_config);

    setupTimerPedal();  // CREA IL TIMER PER GESTIRE IN SICUREZZA IL PEDALE

    #ifdef OPENFIRE_ESPNOW_WIFI_POWER_AUTO // ==========================================================
      if (espnow_wifi_power_auto) {
        SerialWireless.SendPacket((const uint8_t *)aux_buffer, 1, PACKET_TX::RSSI_FEEDBACK);
        SerialWireless.SendPacket((const uint8_t *)aux_buffer, 1, PACKET_TX::RSSI_FEEDBACK);
        SerialWireless.SendPacket((const uint8_t *)aux_buffer, 1, PACKET_TX::RSSI_FEEDBACK);
        //espnow_wifi_power = 45;
      }
    #endif //OPENFIRE_ESPNOW_WIFI_POWER_AUTO // ==========================================================


    #if defined(GUN) && defined(USES_DISPLAY)
      if (animTaskHandleLink_pedal != NULL) {
        vTaskDelete(animTaskHandleLink_pedal);
        animTaskHandleLink_pedal = NULL;
      }
    #endif // USES_DISPLAY

    TinyUSBDevices.is_pedal_wireless = true;
    //TinyUSBDevices.onBattery = true;
    return true;  
  }
  
  #if defined(GUN) && defined(USES_DISPLAY)
    if (animTaskHandleLink_pedal != NULL) {
      vTaskDelete(animTaskHandleLink_pedal);
      animTaskHandleLink_pedal = NULL;
    }
  #endif // USES_DISPLAY

  TinyUSBDevices.is_pedal_wireless = false;
  return false; 

}


// ======================= IMPLEMENTAZIONE PEDAL - RIMANE IN ASCOLTO SU TUTTI I CANALI ===============
bool SerialWireless_::connection_pedal() {
  
    
  uint8_t channel = espnow_wifi_channel;   // tra e 1 e 13 (il 14 dovrebbe essere riservato)
  
  #define TIMEOUT_CHANGE_CHANNEL 2000 // in millisecondi - cambia canale ogni
  #define TIMEOUT_DIALOGUE 6000 // in millisecondi - tempo massimo per completare operazione accoppiamento
  unsigned long lastMillis_change_channel = millis ();
  unsigned long lastMillis_start_dialogue = millis ();
  
   
  
  stato_connessione_wireless = CONNECTION_STATE::NONE_CONNECTION;
  
  broadcast_receiver = true;

  while (stato_connessione_wireless != CONNECTION_STATE::DEVICES_CONNECTED) {
    if (stato_connessione_wireless == CONNECTION_STATE::NONE_CONNECTION) {
      if (((millis() - lastMillis_change_channel) > TIMEOUT_CHANGE_CHANNEL)) { 
         
        esp_wifi_set_promiscuous(true);
        if (esp_wifi_set_channel(channel, WIFI_SECOND_CHAN_NONE) != ESP_OK) {
          //Serial.printf("DONGLE - esp_wifi_set_channel failed!");
        }
        esp_wifi_set_promiscuous(false);
        
        espnow_wifi_channel = channel;
        
        peerInfo.channel = channel;  // si potrebbe anche impostare sempre a 0 che usa quello del wifi
        if (esp_now_mod_peer(&peerInfo) != ESP_OK) {  // modifica il canale del peer
          //Serial.println("DONGLE - Errore nella modifica del canale");
        }             
        lastMillis_change_channel = millis ();
        
        
