wei134102/OpenFIRE-Firmware-ESP32/shared_lib/OpenFIRE_Wireless/ESP32/OpenFIRE_Wireless.cpp
        channel++;
        if (channel >13) channel = 1;
      }
      
      lastMillis_start_dialogue = millis();
    }
    else {
      if (((millis() - lastMillis_start_dialogue) > TIMEOUT_DIALOGUE) && stato_connessione_wireless != CONNECTION_STATE::DEVICES_CONNECTED) {
        stato_connessione_wireless = CONNECTION_STATE::NONE_CONNECTION;
        //Serial.println("DONGLE - Non si è conclusa la negoziazione tra DONGLE/GUN e si riparte da capo");
        lastMillis_change_channel = millis ();
      }  
    }
    taskYIELD();
    //vTaskDelay(pdMS_TO_TICKS(10));
    //yield(); // in attesa dello stabilimento di una connessione
  }
    
  broadcast_receiver = false;
    
    //Serial.println("DONGLE - Negosazione completata - associazione dei dispositivi GUN/DONGLE");
    if (esp_now_del_peer(peerAddress) != ESP_OK) {  // cancella il broadcast dai peer
      //Serial.println("DONGLE - Errore nella cancellazione del peer broadcast");
    }
    memcpy(peerAddress, mac_esp_another_card, 6);
    memcpy(peerInfo.peer_addr, peerAddress, 6);
    espnow_wifi_channel=usb_data_wireless.channel;
    esp_wifi_set_promiscuous(true);
    esp_wifi_set_channel(espnow_wifi_channel, WIFI_SECOND_CHAN_NONE);
    esp_wifi_set_promiscuous(false);
    peerInfo.channel = espnow_wifi_channel;
    //peerInfo.channel = ESPNOW_WIFI_CHANNEL;
    //peerInfo.encrypt = false;              
    if (esp_now_add_peer(&peerInfo) != ESP_OK) {  // inserisce il dongle nei peer
      //Serial.println("DONGLE - Errore nell'aggiunta del nuovo peer della GUN");
    } else esp_now_set_peer_rate_config(peerAddress, &rate_config);

    #ifdef OPENFIRE_ESPNOW_WIFI_POWER_AUTO // ==========================================================
      if (espnow_wifi_power_auto) {
        SerialWireless.SendPacket((const uint8_t *)aux_buffer, 1, PACKET_TX::RSSI_FEEDBACK);
        SerialWireless.SendPacket((const uint8_t *)aux_buffer, 1, PACKET_TX::RSSI_FEEDBACK);
        SerialWireless.SendPacket((const uint8_t *)aux_buffer, 1, PACKET_TX::RSSI_FEEDBACK);
        //espnow_wifi_power = 45;
      }
    #endif //OPENFIRE_ESPNOW_WIFI_POWER_AUTO // ==========================================================
  
    TinyUSBDevices.onBattery = true;
    return true;  
      
}

void packet_callback_read_dongle() {
  switch (SerialWireless.packet.currentPacketID()) {
    case PACKET_TX::SERIAL_TX:
      Serial.write(&SerialWireless.packet.rxBuff[PREAMBLE_SIZE], SerialWireless.packet.bytesRead);
      Serial.flush(); // ????
      break;
    case PACKET_TX::MOUSE_TX :
      usbHid.sendReport(HID_RID_e::HID_RID_MOUSE, &SerialWireless.packet.rxBuff[PREAMBLE_SIZE], SerialWireless.packet.bytesRead);  
      break;
    case PACKET_TX::GAMEPADE_TX:
      usbHid.sendReport(HID_RID_e::HID_RID_GAMEPAD, &SerialWireless.packet.rxBuff[PREAMBLE_SIZE], SerialWireless.packet.bytesRead);
      break;
    case PACKET_TX::KEYBOARD_TX:
      usbHid.sendReport(HID_RID_e::HID_RID_KEYBOARD, &SerialWireless.packet.rxBuff[PREAMBLE_SIZE], SerialWireless.packet.bytesRead);
      break;
    // ====== poi va tolto ================
    case PACKET_TX::PEDAL_TX:
      {
        memcpy(aux_buffer, &SerialWireless.packet.rxBuff[PREAMBLE_SIZE], SerialWireless.packet.bytesRead);
        TinyUSBDevices.is_pedal_wireless = (bool)aux_buffer[0];
        SerialWireless.is_pedal_wireless_comunication = true;
      }
      break;
    // ====== fine poi va tolto  
    #ifdef OPENFIRE_USE_ESPNOW_UNIFIED_PACKET
    case PACKET_TX::MOUSE_KEY_PAD_TX: { // ATTENZIONE: Le parentesi graffe qui sono OBBLIGATORIE in C++ per dichiarare variabili dentro un 'case'
      
      // Calcoliamo l'indirizzo base UNA sola volta e lo mettiamo nel puntatore 'ptr'
      uint8_t* ptr = &SerialWireless.packet.rxBuff[PREAMBLE_SIZE];

      // --- MOUSE ---
      // Confrontiamo il buffer con l'ultimo stato noto
      if (memcmp(ptr, &absmouse5Report_last_wifi, sizeof(absmouse5Report_last_wifi))) {
        //memcpy(&absmouse5Report_last_wifi, ptr, sizeof(absmouse5Report_last_wifi));
        if (usbHid.sendReport(HID_RID_e::HID_RID_MOUSE, ptr, sizeof(absmouse5Report_last_wifi)))
          memcpy(&absmouse5Report_last_wifi, ptr, sizeof(absmouse5Report_last_wifi));
      }
      ptr += sizeof(absmouse5Report_last_wifi); // Fai scorrere il puntatore in avanti alla fine dei dati mouse

      // --- TASTIERA ---
      if (memcmp(ptr, &keyReport_last_wifi, sizeof(keyReport_last_wifi))) {
        //memcpy(&keyReport_last_wifi, ptr, sizeof(keyReport_last_wifi));
        if (usbHid.sendReport(HID_RID_e::HID_RID_KEYBOARD, ptr, sizeof(keyReport_last_wifi)))
          memcpy(&keyReport_last_wifi, ptr, sizeof(keyReport_last_wifi));
      }
      ptr += sizeof(keyReport_last_wifi); // Fai scorrere il puntatore in avanti alla fine dei dati tastiera

      // --- GAMEPAD ---
      if (memcmp(ptr, &gamepad16Report_last_wifi, sizeof(gamepad16Report_last_wifi))) {
        //memcpy(&gamepad16Report_last_wifi, ptr, sizeof(gamepad16Report_last_wifi));
        if (usbHid.sendReport(HID_RID_e::HID_RID_GAMEPAD, ptr, sizeof(gamepad16Report_last_wifi)))
          memcpy(&gamepad16Report_last_wifi, ptr, sizeof(gamepad16Report_last_wifi));
      }
      
      break;  
    } // Chiusura del blocco del case
    #endif // OPENFIRE_USE_ESPNOW_UNIFIED_PACKET
    #ifdef OPENFIRE_ESPNOW_WIFI_POWER_AUTO
    case PACKET_TX::DUMMY_PACKET:
      /* pacchetto vuoto - non fare nulla - per eventuali test - da implementare se necessario */
      /* code */  
      break; 
    case PACKET_TX::RSSI_FEEDBACK:
      /* richiesta di inviare rssi quindi inviare un pacchetto rssi_report con l'rssi */
      aux_buffer[0] = last_rssi_percepito;
      SerialWireless.SendPacket((const uint8_t *)aux_buffer, 1, PACKET_TX::RSSI_REPORT);
      break; 
    case PACKET_TX::RSSI_REPORT:
      /* ricevuto ul pacchetto rssi, quindi adattare la potenza di trasmissione in base a tale valore */
      {
        memcpy(aux_buffer, &SerialWireless.packet.rxBuff[PREAMBLE_SIZE], SerialWireless.packet.bytesRead);
        int8_t rssi_misurato_dall_altro = (int8_t)aux_buffer[0];
        uint8_t mia_nuova_potenza = calcolaPotenzaOttimale(rssi_misurato_dall_altro);
        if (esp_wifi_set_max_tx_power(mia_nuova_potenza) == ESP_OK) {
          espnow_wifi_power = mia_nuova_potenza;
          espnow_rssi_ricevuto = rssi_misurato_dall_altro;
          ultimo_rssi_trasmesso = last_rssi_percepito;
          //espnow_wifi_power = 41;
        }
      }
      break; 
    #endif //OPENFIRE_ESPNOW_WIFI_POWER_AUTO
    case PACKET_TX::CHECK_CONNECTION_LAST_DONGLE:
      // CODICE
      memcpy(aux_buffer, &SerialWireless.packet.rxBuff[PREAMBLE_SIZE], SerialWireless.packet.bytesRead);
      switch (aux_buffer[0])
      {
      case CONNECTION_STATE::TX_CHECK_CONNECTION_LAST_DONGLE:
        if ((memcmp(&aux_buffer[1],peerAddress,6) == 0) && 
           (memcmp(&aux_buffer[7],SerialWireless.mac_esp_inteface,6) == 0) &&
           SerialWireless.stato_connessione_wireless == CONNECTION_STATE::DEVICES_CONNECTED) { 
              aux_buffer[0] = CONNECTION_STATE::TX_CONFERM_CONNECTION_LAST_DONGLE; 
              memcpy(&aux_buffer[1], SerialWireless.mac_esp_inteface, 6);
              memcpy(&aux_buffer[7], peerAddress, 6);
              // valutare se inviarlo un paio di volte il pacchetto o solo una volta
              // lo invia 3 volte - una volta ogni 70ms
              for (uint8_t i = 0; i<3; i++) {
                if (i>0) {
                  //vTaskDelay(pdMS_TO_TICKS(1000)); // equivalente a delay(1000) ma non bloccante su esp32
                  unsigned long lastMillis_tx_packet_connection_last_dongle = millis();
                  while ((millis() - lastMillis_tx_packet_connection_last_dongle) < 70) taskYIELD(); ///////yield(); 
                }
                SerialWireless.SendPacket((const uint8_t *)aux_buffer, 13, PACKET_TX::CHECK_CONNECTION_LAST_DONGLE);
              }
        }
        break;
      default:
        break;
      }     
      break;
    case PACKET_TX::CONNECTION:
      memcpy(aux_buffer, &SerialWireless.packet.rxBuff[PREAMBLE_SIZE], SerialWireless.packet.bytesRead); //sizeof(aux_buffer));
      //Serial.println("DONGLE - arrivato richiesta di connessione");
      switch (aux_buffer[0]) {
        // =========================== NUOVI ==================================
        case CONNECTION_STATE::TX_GUN_SEARCH_DONGLE_BROADCAST:
          if ((SerialWireless.stato_connessione_wireless == CONNECTION_STATE::NONE_CONNECTION) &&
              (aux_buffer[13] == espnow_wifi_channel))
          { // prende la prima gun disposnibile
            memcpy(SerialWireless.mac_esp_another_card, &aux_buffer[1], 6);
            // invia richiesta connessione
            aux_buffer[0] = CONNECTION_STATE::TX_DONGLE_TO_GUN_PRESENCE;
            memcpy(&aux_buffer[1], SerialWireless.mac_esp_inteface, 6);
            memcpy(&aux_buffer[7], SerialWireless.mac_esp_another_card, 6);
            aux_buffer[13] = espnow_wifi_channel;
            SerialWireless.SendPacket((const uint8_t *)aux_buffer, 14, PACKET_TX::CONNECTION);
            SerialWireless.stato_connessione_wireless = CONNECTION_STATE::TX_DONGLE_TO_GUN_PRESENCE;
            // assicurati che i dati siano stati spediti

