wei134102/OpenFIRE-Firmware-ESP32/shared_lib/OpenFIRE_Wireless/ESP32/OpenFIRE_Wireless.cpp
          }
          break;
        case CONNECTION_STATE::TX_GUN_TO_DONGLE_ACCEPT:
          if ((memcmp(&aux_buffer[1],SerialWireless.mac_esp_another_card,6) == 0) && 
             (memcmp(&aux_buffer[7],SerialWireless.mac_esp_inteface,6) == 0) &&
              SerialWireless.stato_connessione_wireless == CONNECTION_STATE::TX_DONGLE_TO_GUN_PRESENCE) {
              
                // SALVA I DATI RELATIVI ALLA GUN VID, PID, PLAYER , ECC.ECC.
              memcpy(&usb_data_wireless, &aux_buffer[13], sizeof(usb_data_wireless));
              
              aux_buffer[0] = CONNECTION_STATE::TX_DONGLE_TO_GUN_CONFERM;
              memcpy(&aux_buffer[1], SerialWireless.mac_esp_inteface, 6);
              memcpy(&aux_buffer[7], SerialWireless.mac_esp_another_card, 6);
                            
              // =========================================================
              // INVIARE IL PACCHETTO FINALE PIU' VOLTE  
              // =========================================================
              for (uint8_t i = 0; i<3; i++) {
                if (i>0) {
                  //vTaskDelay(pdMS_TO_TICKS(1000)); // equivalente a delay(1000) ma non bloccante su esp32
                  unsigned long lastMillis_tx_packet_gun_to_dongle_conferm = millis();
                  while ((millis() - lastMillis_tx_packet_gun_to_dongle_conferm) < 70) taskYIELD(); /////yield(); 
                }
                SerialWireless.SendPacket((const uint8_t *)aux_buffer, 13, PACKET_TX::CONNECTION);
              }
              SerialWireless.stato_connessione_wireless = CONNECTION_STATE::DEVICES_CONNECTED;
          }
          break;          
        // =========================== FINE NUOVI =============================

        default:
          break;
      }
      break;  
    default:
      break;
  }
}

void packet_callback_read_gun() {
  switch (SerialWireless.packet.currentPacketID()) {
    case PACKET_TX::SERIAL_TX:
      SerialWireless.write_on_rx_serialBuffer(&SerialWireless.packet.rxBuff[PREAMBLE_SIZE], SerialWireless.packet.bytesRead);
      break;
    case PACKET_TX::MOUSE_TX :
      /* code */
      break;
    case PACKET_TX::GAMEPADE_TX:
      /* code */
      break;
    case PACKET_TX::KEYBOARD_TX:
      /* code */  
      break;
    case PACKET_TX::PEDAL_TX:
      {
 #if defined(GUN) && defined(USES_DISPLAY)
        // ==========================================
        display_OLED->setCursor(1, 30);
  display_OLED->setTextSize(1);
  display_OLED->setTextColor(WHITE, BLACK);
  //display_OLED->fillRect(0, 0, 128, 16, BLACK);
  //display_OLED->drawFastHLine(0, 15, 128, WHITE);
  //char buffer[30];
  //sprintf(buffer, "Ch:%2d Waiting link", channel_tread);
  display_OLED->print("PEDAL PEDAL");
  display_OLED->display();
#endif // defined(GUN) && defined(USES_DISPLAY)
  // =====================================================
        
        //uint8_t pedali;
        //  pedal attivo = 00000001 - pedal2 attivo = 00000010 - entrambi pedali attivi = 00000011 - tutti i pedali non premuti = 00000000
        //pedali = aux_buffer[0];
        memcpy(aux_buffer, &SerialWireless.packet.rxBuff[PREAMBLE_SIZE], SerialWireless.packet.bytesRead);
        TinyUSBDevices.pedals_wireless_state = aux_buffer[0];
        //TinyUSBDevices.pedal_wireless = (pedali & 0b00000001) != 0;  //false = pedale non premuto;
        //TinyUSBDevices.pedal2_wireless = (pedali & 0b00000010) != 0; //false = pedale non premuto;
        esp_timer_stop(timer_handle_pedal); 
        if (TinyUSBDevices.pedals_wireless_state) esp_timer_start_once(timer_handle_pedal, MAX_TIMEOUT_LAST_PACKET);
      }
      break;
    #ifdef OPENFIRE_ESPNOW_WIFI_POWER_AUTO
    case PACKET_TX::DUMMY_PACKET:
      /* pacchetto vuoto - non fare nulla - per eventuali test - da implementare se necessario */
      /* code */  
      break; 
    case PACKET_TX::RSSI_FEEDBACK:
      /* richiesta di inviare rssi quindi inviare un pacchetto rssi_report con l'rssi */
      aux_buffer[0] = last_rssi_percepito;
      SerialWireless.SendPacket((const uint8_t *)aux_buffer, 1, PACKET_TX::RSSI_REPORT);
      break; 
    case PACKET_TX::RSSI_REPORT:
      /* ricevuto ul pacchetto rssi, quindi adattare la potenza di trasmissione in base a tale valore */
      {
        memcpy(aux_buffer, &SerialWireless.packet.rxBuff[PREAMBLE_SIZE], SerialWireless.packet.bytesRead);
        int8_t rssi_misurato_dall_altro = (int8_t)aux_buffer[0];
        uint8_t mia_nuova_potenza = calcolaPotenzaOttimale(rssi_misurato_dall_altro);
        if (esp_wifi_set_max_tx_power(mia_nuova_potenza) == ESP_OK) {
          espnow_wifi_power = mia_nuova_potenza;
          espnow_rssi_ricevuto = rssi_misurato_dall_altro;
          ultimo_rssi_trasmesso = last_rssi_percepito;
          //espnow_wifi_power = 41;
        }
      }      
      break;
    #endif //OPENFIRE_ESPNOW_WIFI_POWER_AUTO
    case PACKET_TX::CHECK_CONNECTION_LAST_DONGLE:
      // CODICE VALUTARE SE FARE CONTROLLO SE PISTOLA ANCORA CONNESSA .. SE NON CONNESSA RIAVVIA LA SCHEDA ?
      memcpy(aux_buffer, &SerialWireless.packet.rxBuff[PREAMBLE_SIZE], SerialWireless.packet.bytesRead);
      switch (aux_buffer[0])
      {
      case CONNECTION_STATE::TX_CONFERM_CONNECTION_LAST_DONGLE:
        if ((memcmp(&aux_buffer[1],peerAddress,6) == 0) && 
           (memcmp(&aux_buffer[7],SerialWireless.mac_esp_inteface,6) == 0) &&
           SerialWireless.stato_connessione_wireless == CONNECTION_STATE::NONE_CONNECTION_DONGLE) { 
            SerialWireless.stato_connessione_wireless = CONNECTION_STATE::DEVICES_CONNECTED_WITH_LAST_DONGLE;
        }
        break;
      default:
        break;
      }     
      break;
    case PACKET_TX::CONNECTION:
      memcpy(aux_buffer, &SerialWireless.packet.rxBuff[PREAMBLE_SIZE], SerialWireless.packet.bytesRead); //13); //sizeof(aux_buffer)); // qui va bene anche 13 come dati da copiare
      switch (aux_buffer[0]) {
        // ================== NUOVI ==================== // AL PRIMO PACCHETTO IL DONGLE TRASMETTE ANCHE IL CANALE PER EVITARE CHE NEL FRATTEMPO IL CICLO VADA AVANTI ED IL CANALE 
        case CONNECTION_STATE::TX_DONGLE_TO_GUN_PRESENCE:
          if ((memcmp(&aux_buffer[7],SerialWireless.mac_esp_inteface,6) == 0) && SerialWireless.stato_connessione_wireless == CONNECTION_STATE::NONE_CONNECTION) {
            memcpy(SerialWireless.mac_esp_another_card, &aux_buffer[1], 6);
            usb_data_wireless.channel= aux_buffer[13];
            aux_buffer[0] = CONNECTION_STATE::TX_GUN_TO_DONGLE_ACCEPT;
            memcpy(&aux_buffer[1], SerialWireless.mac_esp_inteface, 6);
            memcpy(&aux_buffer[7], SerialWireless.mac_esp_another_card, 6);
            // INVIA ANCHE DATI RELATIVI A VID, PID, ECC,ECC, DELLA GUN
            memcpy(&aux_buffer[13], &usb_data_wireless, sizeof(usb_data_wireless));
            SerialWireless.SendPacket((const uint8_t *)aux_buffer, sizeof(aux_buffer), PACKET_TX::CONNECTION);
            SerialWireless.stato_connessione_wireless = CONNECTION_STATE::TX_GUN_TO_DONGLE_ACCEPT;
          }
          break;
        case CONNECTION_STATE::TX_DONGLE_TO_GUN_CONFERM:
          if ((memcmp(&aux_buffer[1],SerialWireless.mac_esp_another_card,6) == 0) && 
             (memcmp(&aux_buffer[7],SerialWireless.mac_esp_inteface,6) == 0) &&
             SerialWireless.stato_connessione_wireless == CONNECTION_STATE::TX_GUN_TO_DONGLE_ACCEPT) {           
            SerialWireless.stato_connessione_wireless = CONNECTION_STATE::DEVICES_CONNECTED;
        }
          break;
        // ================== FINE NUOVI =================
        default:
          break;
      }
      break;
    case PACKET_TX::CONNECTION_PEDAL:
      memcpy(aux_buffer, &SerialWireless.packet.rxBuff[PREAMBLE_SIZE], SerialWireless.packet.bytesRead); //13); //sizeof(aux_buffer)); // qui va bene anche 13 come dati da copiare
      switch (aux_buffer[0]) {
        // ================== NUOVI ==================== // AL PRIMO PACCHETTO IL DONGLE TRASMETTE ANCHE IL CANALE PER EVITARE CHE NEL FRATTEMPO IL CICLO VADA AVANTI ED IL CANALE 
        case CONNECTION_STATE::TX_PEDAL_TO_GUN_PRESENCE:
          if ((memcmp(&aux_buffer[7],SerialWireless.mac_esp_inteface,6) == 0) && SerialWireless.stato_connessione_wireless == CONNECTION_STATE::NONE_CONNECTION) {
            memcpy(SerialWireless.mac_esp_another_card, &aux_buffer[1], 6);
            usb_data_wireless.channel= espnow_wifi_channel;  // non dovrebbe servire
            aux_buffer[0] = CONNECTION_STATE::TX_GUN_TO_PEDAL_ACCEPT;
            memcpy(&aux_buffer[1], SerialWireless.mac_esp_inteface, 6);
            memcpy(&aux_buffer[7], SerialWireless.mac_esp_another_card, 6);
            // INVIA ANCHE DATI RELATIVI A VID, PID, ECC,ECC, DELLA GUN
            memcpy(&aux_buffer[13], &usb_data_wireless, sizeof(usb_data_wireless));
            SerialWireless.SendPacket((const uint8_t *)aux_buffer, sizeof(aux_buffer), PACKET_TX::CONNECTION_PEDAL);
            SerialWireless.stato_connessione_wireless = CONNECTION_STATE::TX_GUN_TO_PEDAL_ACCEPT;
          }
          break;
        case CONNECTION_STATE::TX_PEDAL_TO_GUN_CONFERM:
          if ((memcmp(&aux_buffer[1],SerialWireless.mac_esp_another_card,6) == 0) && 
             (memcmp(&aux_buffer[7],SerialWireless.mac_esp_inteface,6) == 0) &&
             SerialWireless.stato_connessione_wireless == CONNECTION_STATE::TX_GUN_TO_PEDAL_ACCEPT) {           
            SerialWireless.stato_connessione_wireless = CONNECTION_STATE::DEVICES_CONNECTED;
        }
          break;
        // ================== FINE NUOVI =================
        default:
          break;
      }
      break;
    default:
      break;
  }
}

void packet_callback_read_pedal() {
  switch (SerialWireless.packet.currentPacketID()) {
    case PACKET_TX::SERIAL_TX:
      break;
    case PACKET_TX::MOUSE_TX :
      break;
    case PACKET_TX::GAMEPADE_TX:
      break;
    case PACKET_TX::KEYBOARD_TX:
      break;
    #ifdef OPENFIRE_USE_ESPNOW_UNIFIED_PACKET
    case PACKET_TX::MOUSE_KEY_PAD_TX: { // ATTENZIONE: Le parentesi graffe qui sono OBBLIGATORIE in C++ per dichiarare variabili dentro un 'case'
      break;  
    } // Chiusura del blocco del case
    #endif // OPENFIRE_USE_ESPNOW_UNIFIED_PACKET
    #ifdef OPENFIRE_ESPNOW_WIFI_POWER_AUTO
    case PACKET_TX::DUMMY_PACKET:
      /* pacchetto vuoto - non fare nulla - per eventuali test - da implementare se necessario */
      /* code */  
      break; 
    case PACKET_TX::RSSI_FEEDBACK:
      /* richiesta di inviare rssi quindi inviare un pacchetto rssi_report con l'rssi */
      aux_buffer[0] = last_rssi_percepito;
      SerialWireless.SendPacket((const uint8_t *)aux_buffer, 1, PACKET_TX::RSSI_REPORT);
      break; 
    case PACKET_TX::RSSI_REPORT:
      /* ricevuto ul pacchetto rssi, quindi adattare la potenza di trasmissione in base a tale valore */
      {
        memcpy(aux_buffer, &SerialWireless.packet.rxBuff[PREAMBLE_SIZE], SerialWireless.packet.bytesRead);
        int8_t rssi_misurato_dall_altro = (int8_t)aux_buffer[0];
        uint8_t mia_nuova_potenza = calcolaPotenzaOttimale(rssi_misurato_dall_altro);
        if (esp_wifi_set_max_tx_power(mia_nuova_potenza) == ESP_OK) {
          espnow_wifi_power = mia_nuova_potenza;
          espnow_rssi_ricevuto = rssi_misurato_dall_altro;
          ultimo_rssi_trasmesso = last_rssi_percepito;
          //espnow_wifi_power = 41;
        }
      }
      break; 
    #endif //OPENFIRE_ESPNOW_WIFI_POWER_AUTO
    case PACKET_TX::CHECK_CONNECTION_LAST_PEDAL:
      // CODICE
      memcpy(aux_buffer, &SerialWireless.packet.rxBuff[PREAMBLE_SIZE], SerialWireless.packet.bytesRead);
      switch (aux_buffer[0])
      {
      case CONNECTION_STATE::TX_CHECK_CONNECTION_LAST_PEDAL:
        if ((memcmp(&aux_buffer[1],peerAddress,6) == 0) && 
           (memcmp(&aux_buffer[7],SerialWireless.mac_esp_inteface,6) == 0) &&
           SerialWireless.stato_connessione_wireless == CONNECTION_STATE::DEVICES_CONNECTED) { 
              aux_buffer[0] = CONNECTION_STATE::TX_CONFERM_CONNECTION_LAST_PEDAL; 
              memcpy(&aux_buffer[1], SerialWireless.mac_esp_inteface, 6);
              memcpy(&aux_buffer[7], peerAddress, 6);
              // valutare se inviarlo un paio di volte il pacchetto o solo una volta
              // lo invia 3 volte - una volta ogni 70ms
              for (uint8_t i = 0; i<3; i++) {
                if (i>0) {
                  //vTaskDelay(pdMS_TO_TICKS(1000)); // equivalente a delay(1000) ma non bloccante su esp32
                  unsigned long lastMillis_tx_packet_connection_last_dongle = millis();
                  while ((millis() - lastMillis_tx_packet_connection_last_dongle) < 70) taskYIELD();  ////yield(); 
                }
                SerialWireless.SendPacket((const uint8_t *)aux_buffer, 13, PACKET_TX::CHECK_CONNECTION_LAST_PEDAL);
              }
        }
        break;
      default:
        break;
      }     
      break;
    case PACKET_TX::CONNECTION_PEDAL:
      memcpy(aux_buffer, &SerialWireless.packet.rxBuff[PREAMBLE_SIZE], SerialWireless.packet.bytesRead); //sizeof(aux_buffer));
      //Serial.println("DONGLE - arrivato richiesta di connessione");
      switch (aux_buffer[0]) {
        // =========================== NUOVI ==================================
        case CONNECTION_STATE::TX_GUN_SEARCH_PEDAL_BROADCAST:
          if ((SerialWireless.stato_connessione_wireless == CONNECTION_STATE::NONE_CONNECTION) &&
              (aux_buffer[13] == espnow_wifi_channel))  // sistema espnow_wifi_channel
          { // prende la prima gun disposnibile
            memcpy(SerialWireless.mac_esp_another_card, &aux_buffer[1], 6);
            // invia richiesta connessione
            aux_buffer[0] = CONNECTION_STATE::TX_PEDAL_TO_GUN_PRESENCE;
            memcpy(&aux_buffer[1], SerialWireless.mac_esp_inteface, 6);
            memcpy(&aux_buffer[7], SerialWireless.mac_esp_another_card, 6);
            /////aux_buffer[13] = espnow_wifi_channel;  // no??????????????????????????????????????????????????????????????????????
            SerialWireless.SendPacket((const uint8_t *)aux_buffer, 13, PACKET_TX::CONNECTION_PEDAL);
            SerialWireless.stato_connessione_wireless = CONNECTION_STATE::TX_PEDAL_TO_GUN_PRESENCE;
            // assicurati che i dati siano stati spediti

